1DV/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0;
        smoother        DIC;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    pFinal
    {
        $p;
        tolerance       1e-10;
        relTol          0;
    }

    "(k|epsilon|omega)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.0;
    }

    "(k|epsilon|omega)Final"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-18;
        relTol          1e-6;
    }
    alpha
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
        minIter         1;
    }
    alphaFinal
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
        minIter         1;
    }
    Theta
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.001;
    }
    ThetaFinal
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
        minIter         1;
        maxIter         100;
    }
}


PIMPLE
{
    momentumPredictor no;
    nCorrectors     3;
    nNonOrthogonalCorrectors 0;
    correctAlpha    no;
    nAlphaCorr      1;
    pRefPoint        (0.02 0.4999 0);
    pRefValue       0;
}

elaxationFactors
{
    fields
    {
        p               0.3;
        nuFra               0.3;
    }
    equations
    {
        k               0.7;
        epsilon           0.7;
        Theta           0.7;
        Ua           0.7;
        alpha           0.3;
    }

// ************************************************************************* //
